serverless-compare-langs/rust/tests/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  processor: "generator.js"
  phases:
    - duration: 600
      arrivalRate: 300

scenarios:
  - name: "Generate products"
    weight: 1
    flow:
      - function: "generateProduct"
      - put:
          url: "/{{ id }}"
          headers:
            Content-Type: "application/json"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            price: "{{ price }}"
      - loop:
         - get:
            url: "/{{ id }}"
        count: 100
      - think: 3
      - delete:
          url: "/{{ id }}"
  - name: "Get product listing"
    weight: 5
    flow:
      - get:
          url: "/"